/*
    ╔═══════════════════════════════╗
    ║          THE BOSS LAB         ║
    ╚═══════════════════════════════╝
         .-=========-.
         ( o )   ( o )
          |/ \___/ \|
           \  | |  /
            \_____/
             |   |
        /----|   |----\
       /     |   |     \.          /|
      /      |___|      \.        / |
     /      /=====\      \.      /  |
    /      |#######|      \.    /___/
   /       |#######|       \.    ||
  /        |#######|        \.   ||
 /         |#######|         \   ||
/          |#######|          \  ||
*/

int main()
{
    // Задание 6.1. Создаем «картотеку» книг (структура Book из ЛР5).
    // «Картотека» - это массив структур => нужно такой массив создать.
    // Замечание: размер массива придется увеличивать по мере добавления книг

    // Пользователь должен иметь возможность выполнять
    // разные действия с картотекой => нужно такую возможность ему
    // предоставить: это может выглядеть как вывод "меню" (перечень
    // возможных действий и соответствующих реакций пользователя), например:
    // Распечатать содержимое картотеки (1)
    // Ввести новую книгу (2)
    // Удалить существующую(ие) (3)
    // Записать текущее содержимое картотеки в файл (4)
    // Считать из файла содержимое в картотеку (5)
    // ... // по желанию можно добавить другие опции
    // Выход из программы

    // для файлового ввода/вывода используйте функции fprintf и fscanf

    // Задание 2. Предоставьте пользователю возможность выводить перечень книг
    // в определенном порядке - напишите функцию (функции) сортировки массива
    // по любому из полей структуры.
    // Замечание: признак "по какому полю сортируем" можно ввести с помощью перечисления
}